artillery.yml
config:
  # target: "http://ec2-54-200-168-147.us-west-2.compute.amazonaws.com:8080"
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 250
      name: 'warm up'
    # - duration: 45
    #   arrivalRate: 20
    # - duration: 100
    #   arrivalRate: 10
    #   rampTo: 500
  http:
      timeout: 10
  payload:
    path: "supplyMock.csv"
    fields:  
      - "time_stamp"
      - "driver_id"
    # order: "sequence" # if remove this, random by default
  environments:
    production:
      target: "http://YOUR_PRODUCTION_SERVER_IP:PORT"
    staging:
      target: "http://YOUR_STAGING_SERVER_IP:PORT"
    debug:
      target: "http://YOUR_DEV_SERVER_IP:PORT"
 
scenarios:
  - flow:
    - post:
        url: "/driver/enqueue"
        json:
          time_stamp: "{{time_stamp}}"
          driver_id: "{{driver_id}}"
        DISABLE_ENCRIPT: 1